In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([4,7,-5,3]) # python의 list, dictionary, numpy의 array를 인자로 가짐

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj.dtypes

dtype('int64')

In [11]:
obj2 = pd.Series([4,7,-5,3], index=['d', 'b', 'a', 'c'])

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [18]:
sdata = {"Charles":35000, 'Kilho':71000, "Hayoung":16000, "sangjae":5000}
obj3 = pd.Series(sdata)

In [19]:
obj3

Charles    35000
Hayoung    16000
Kilho      71000
sangjae     5000
dtype: int64

In [21]:
obj3.name = "Salary"
obj3.index.name = "Names"

In [22]:
obj3

Names
Charles    35000
Hayoung    16000
Kilho      71000
sangjae     5000
Name: Salary, dtype: int64

In [23]:
obj3.index = ['A', 'B', 'C', 'D']

In [24]:
obj3

A    35000
B    16000
C    71000
D     5000
Name: Salary, dtype: int64

In [26]:
#array나 dictionary를 인자로 가짐
data = {"names": ["Kilho","Kilho","Kilho","Charles","Charles"],
       "year": [2014, 2015, 2016, 2015, 2016],
       "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)

In [27]:
df

     names  points  year
0    Kilho     1.5  2014
1    Kilho     1.7  2015
2    Kilho     3.6  2016
3  Charles     2.4  2015
4  Charles     2.9  2016

In [28]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [30]:
df.columns

Index(['names', 'points', 'year'], dtype='object')

In [31]:
df.values

array([['Kilho', 1.5, 2014],
       ['Kilho', 1.7, 2015],
       ['Kilho', 3.6, 2016],
       ['Charles', 2.4, 2015],
       ['Charles', 2.9, 2016]], dtype=object)

In [33]:
df.index.name = "Num"
df.columns.name = "Info"

In [34]:
df

Info    names  points  year
Num
0       Kilho     1.5  2014
1       Kilho     1.7  2015
2       Kilho     3.6  2016
3     Charles     2.4  2015
4     Charles     2.9  2016

In [45]:
df2 = pd.DataFrame(data, columns = ["year","names", "points", "penalty"],
                  index = range(1,6))

In [46]:
df2

   year    names  points penalty
1  2014    Kilho     1.5     NaN
2  2015    Kilho     1.7     NaN
3  2016    Kilho     3.6     NaN
4  2015  Charles     2.4     NaN
5  2016  Charles     2.9     NaN

In [47]:
data

{'names': ['Kilho', 'Kilho', 'Kilho', 'Charles', 'Charles'],
 'points': [1.5, 1.7, 3.6, 2.4, 2.9],
 'year': [2014, 2015, 2016, 2015, 2016]}

In [48]:
df2.index

RangeIndex(start=1, stop=6, step=1)

In [49]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [50]:
df.values

array([['Kilho', 1.5, 2014],
       ['Kilho', 1.7, 2015],
       ['Kilho', 3.6, 2016],
       ['Charles', 2.4, 2015],
       ['Charles', 2.9, 2016]], dtype=object)

In [51]:
df2.describe()

             year    points
count     5.00000  5.000000
mean   2015.20000  2.420000
std       0.83666  0.864292
min    2014.00000  1.500000
25%    2015.00000  1.700000
50%    2015.00000  2.400000
75%    2016.00000  2.900000
max    2016.00000  3.600000